-- 1 task
SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_СЕССИЯ"."ДАТА" FROM "Н_ЛЮДИ"
    RIGHT JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД"="Н_СЕССИЯ"."ЧЛВК_ИД"
    WHERE "Н_ЛЮДИ"."ИД" < 100012 AND "Н_СЕССИЯ"."ИД" < 14369 AND "Н_СЕССИЯ"."ИД" = 27650;
-- для тестов:
--     WHERE "Н_ЛЮДИ"."ИД" < 100032 AND "Н_СЕССИЯ"."ИД" < 14369;


-- 2 task
SELECT "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ИД", "Н_СЕССИЯ"."ЧЛВК_ИД" FROM "Н_ЛЮДИ"
    LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    LEFT JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
    WHERE "Н_ЛЮДИ"."ИД" < 100012 AND "Н_ВЕДОМОСТИ"."ИД" = 39921;
-- для тестов
--     WHERE "Н_ЛЮДИ"."ИД" < 200012 AND "Н_ВЕДОМОСТИ"."ИД" = 39921;

-- проверка:
-- SELECT * FROM "Н_СЕССИЯ" WHERE "ЧЛВК_ИД" = 118015;

-- 3 task
SELECT count(*) FROM (
    SELECT 1 FROM "Н_ЛЮДИ" GROUP BY "Н_ЛЮДИ"."ИМЯ"
                     ) AS TEMP_TABLE;

-- проверка:
-- SELECT COUNT(DISTINCT "Н_ЛЮДИ"."ИМЯ") FROM "Н_ЛЮДИ";

-- task 4
SELECT "ГРУППА" FROM "Н_УЧЕНИКИ" WHERE (EXTRACT(YEAR FROM "НАЧАЛО") = 2011 OR EXTRACT(YEAR FROM "КОНЕЦ") = 2011) AND "СОСТОЯНИЕ" = 'утвержден' AND "ПЛАН_ИД" IN (
    SELECT "Н_ПЛАНЫ"."ИД" FROM "Н_ПЛАНЫ" WHERE "Н_ПЛАНЫ"."ОТД_ИД" = 703
    ) GROUP BY "ГРУППА" HAVING count(*) = 10;
